# VS Code extensions - one extension ID per line
# Install with: code --install-extension <id>

# Language support
ms-python.python
ms-python.debugpy
rust-lang.rust-analyzer
golang.go
hashicorp.terraform
redhat.vscode-yaml
tamasfe.even-better-toml

# Shell
timonwong.shellcheck
foxundermoon.shell-format

# Git
eamodio.gitlens

# Docker / Kubernetes
ms-azuretools.vscode-docker

# Formatting & linting
esbenp.prettier-vscode
dbaeumer.vscode-eslint
charliermarsh.ruff

# Editor utilities
streetsidesoftware.code-spell-checker
christian-kohler.path-intellisense
usernamehw.errorlens
gruntfuggly.todo-tree

# Remote development
ms-vscode-remote.remote-ssh

# Theme
davidseptimus.armada-theme
jvitorfrancisco.theme-acid-purple
