# CLI Tools
brew "awscli"
brew "bash"
brew "bat"
brew "btop"
brew "carapace"
brew "clamav"
brew "curl"
brew "dos2unix"
brew "dust"
brew "duf"
brew "fd"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gum"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "make"
brew "mas"
brew "moreutils"
brew "node"
brew "openssl"
brew "pgformatter"
brew "postgresql"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rustup"
brew "scc"
brew "shellcheck"
brew "starship"
brew "shfmt"
brew "speedtest-cli"
brew "sqlite3"
brew "tcl-tk"
brew "tree"
brew "uv"
brew "viddy"
brew "wget"
brew "xcodegen"
brew "xz"
brew "zlib"

# Casks (Applications)
cask "1password"
cask "discord"
cask "docker-desktop"
cask "espanso"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tailscale-app"
cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-fira-code-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835
