# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"

# CLI Tools
brew "awscli"
brew "bash"
brew "bat"
brew "btop"
brew "clamav"
brew "curl"
brew "dos2unix"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "lsd"
brew "make"
brew "moreutils"
brew "node"
brew "openssl"
brew "pgformatter"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "readline"
brew "redis"
brew "sqlite3"
brew "tcl-tk"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "tree"
brew "wget"
brew "xz"
brew "zlib"

# Casks (Applications)
cask "1password"
cask "discord"
cask "docker"
cask "espanso"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tailscale"
cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-fira-code-nerd-font"
