##
# Preflight
##

# Tap homebrew
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# Brew
brew "ansible"
brew "black"
brew "cask"
brew "docker"
brew "dos2unix"
brew "figlet"
brew "git"
brew "go"
brew "golang"
brew "helm"
brew "isort"
brew "jq"
brew "k9s"
brew "kubectl"
brew "kubernetes-cli"
brew "mariadb-connector-c"
brew "python"
brew "pv"
brew "ranger"
brew "speedtest-cli"
brew "terraform"
brew "tree"
brew "wget"
brew "wifi-password"
brew "yq"
brew "zsh"

# Cask
cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "franz"
cask "google-chrome"
cask "iterm2"
cask "lens"
cask "microsoft-excel"
cask "pycharm"
cask "raspberry-pi-imager"
cask "slack"
cask "sublime-text"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "webex-meetings"
cask "zoom"
